Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_LShapeProfile
The IFC2X3_ParametricObject_LShapeProfile class contains the L-shape profile definition.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_LShapeProfile.Depth
The depth.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_LShapeProfile.Width
The width.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_LShapeProfile.Thickness
The thickness.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_LShapeProfile.FilletRadius
The fillet radius.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_LShapeProfile.EdgeRadius
The edge radius.

Tekla.Structures.Model.Collaboration.IFC2X3_ParametricObject_LShapeProfile.LegSlope
The leg slope.